; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	thermograph0 - mode
	infrared3 - mode
	thermograph4 - mode
	spectrograph1 - mode
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star1 - direction
	Star6 - direction
	Star0 - direction
	GroundStation7 - direction
	Star5 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(have_image Planet8 infrared3)
	(have_image Phenomenon9 infrared2)
	(have_image Planet10 thermograph0)
	(have_image Planet11 infrared3)
	(have_image Planet12 thermograph4)
	(have_image Star13 spectrograph1)
	(have_image Planet14 thermograph0)
	(have_image Phenomenon15 thermograph4)
	(have_image Star16 infrared3)
))

)

; plan
1. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 star16 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star16)
   goals met: 0 of 9
5. (take_image satellite0 star16 instrument1 infrared3)
   added: (have_image star16 infrared3)
   goals met: 1 of 9
6. (turn_to satellite0 planet8 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet8)
   goals met: 1 of 9
7. (take_image satellite0 planet8 instrument1 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 2 of 9
8. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   goals met: 2 of 9
9. (take_image satellite0 planet11 instrument1 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon9 instrument1 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 4 of 9
12. (turn_to satellite0 groundstation7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation7)
   goals met: 4 of 9
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 9
14. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 9
15. (calibrate satellite0 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 4 of 9
16. (turn_to satellite0 phenomenon15 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon15)
   goals met: 4 of 9
17. (take_image satellite0 phenomenon15 instrument2 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 5 of 9
18. (turn_to satellite0 planet10 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet10)
   goals met: 5 of 9
19. (take_image satellite0 planet10 instrument2 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 6 of 9
20. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 6 of 9
21. (take_image satellite0 planet12 instrument2 thermograph4)
   added: (have_image planet12 thermograph4)
   goals met: 7 of 9
22. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 7 of 9
23. (take_image satellite0 planet14 instrument2 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 8 of 9
24. (turn_to satellite0 star13 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star13)
   goals met: 8 of 9
25. (take_image satellite0 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 9 of 9
